app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", ""], ["LIMIT", 1]]
---
    def login
      @user = User.find_by_username(user_params[:username])

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "darlene"], ["created_at", "2018-10-19 00:20:09.804295"], ["updated_at", "2018-10-19 00:20:09.804295"]]
---
    def create
      @user = User.new(user_params)

      if @user.save