api/app/controllers/api/v1/decks_controller.rb

    def index
      @decks = Deck.all
---
SELECT "decks".* FROM "decks"

    def create
      @deck = Deck.new(deck_params)

      if @deck.save
---
INSERT INTO "decks" ("user_id", "name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "u"], ["description", "h"], ["created_at", "2018-10-22 03:11:22.113588"], ["updated_at", "2018-10-22 03:11:22.113588"]]

    def set_deck
      @deck = Deck.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]